/*====================================================================
ファイル名：	dprintf.h
機能概要：シリアル通信機能を使用してPCのコンソール上に文字を出力します。
					シリアルポートの初期化は、外部で行う必要があります。
          CQ出版物より...
====================================================================*/
#ifndef _dprintf_
#define _dprintf_


#define	rsputi(x,y,z) rsputs(convx(x,10,y,z))
#define	rsputx(x,y,z) rsputs(convx(x,16,y,z))

/*====================================================================
関数名：	rsputc
機能：		char型文字を1文字コンソール出力します。
			改行文字の場合はASCIIコードのCRを出力します。
====================================================================*/
extern int rsputc(char c);

/*====================================================================
関数名：	rsputs
機能：		ヌルポインタに当たるまで文字列を出力します。
====================================================================*/
extern char *rsputs(char *s);

/*====================================================================
関数名：	convx
機能：		数字を文字列に変換します。
			dat:	変換する数字
			base:	基数
			clms:	表示桁数（符号を含めて最大7桁）
			fill:	空白に埋めるコード
			戻り値は変換した文字列の先頭のポインタです。
			文字列の終わりはヌル文字です。
====================================================================*/
extern char *convx(int dat,int base,int clms,char fill);

/*====================================================================
関数名：	dprintf
機能：		printfの整数制限バージョンです。
			fmt：	表示文字列
			dprintfは次の変換文字列をサポートします。
			%c：	char型文字1文字
			%s：	char*文字列
			%nx：	int型数字を16進数表示します。
			%nd：	int型数字を10進数表示します。
			%nx、%ndのn位置には表示桁数が入ります。nが0で始まる場合、表示する数の桁が表示桁に満たない場合、残りを０で埋めます。
====================================================================*/
extern void dprintf(const char *fmt, ...);

/*====================================================================
関数名：	dbitprint
機能：		二進数で表示します。MSB -> LSB の順に、len で指定された長さ分を表示します。
			data：	表示データ
			len  :	データビット幅
====================================================================*/
extern void dbitprint(long data, int len);

#endif	/*end of #ifndef _dprintf_*/
